IvanovDmitriy09/Eclipse_templates/Gigadevice/GD32L23x/system/src/cmsis/vectors_gd32l23x.c
/*
 * This file is part of the µOS++ distribution.
 *   (https://github.com/micro-os-plus)
 * Copyright (c) 2014 Liviu Ionescu.
 *
 * Permission is hereby granted, free of charge, to any person
 * obtaining a copy of this software and associated documentation
 * files (the "Software"), to deal in the Software without
 * restriction, including without limitation the rights to use,
 * copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom
 * the Software is furnished to do so, subject to the following
 * conditions:
 *
 * The above copyright notice and this permission notice shall be
 * included in all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES
 * OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
 * NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT
 * HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY,
 * WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR
 * OTHER DEALINGS IN THE SOFTWARE.
 */

// ----------------------------------------------------------------------------

#include "cortexm/exception-handlers.h"

// ----------------------------------------------------------------------------

void __attribute__((weak))
Default_Handler(void);

// Forward declaration of the specific IRQ handlers. These are aliased
// to the Default_Handler, which is a 'forever' loop. When the application
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//

void __attribute__ ((weak, alias ("Default_Handler")))
WWDGT_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
LVD_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TAMPER_STAMP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RTC_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
FMC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RCU_CTC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI3_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI4_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel3_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel4_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel5_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMA_Channel6_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
ADC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBD_HP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBD_LP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER2_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER8_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER11_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER5_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TIMER6_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
UART3_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
UART4_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C0_EV_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C0_ER_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C1_EV_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C1_ER_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SPI1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DAC_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C2_EV_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C2_ER_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
RTC_Alarm_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USBD_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI5_9_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
EXTI10_15_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
DMAMUX_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
CMP0_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
CMP1_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C0_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C2_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART0_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
LPUART_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
CAU_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
TRNG_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
SLCD_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
USART1_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
I2C1_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
LPUART_WKUP_IRQHandler(void);

void __attribute__ ((weak, alias ("Default_Handler")))
LPTIMER_IRQHandler(void);

// ----------------------------------------------------------------------------

extern unsigned int _estack;

typedef void
(* const pHandler)(void);

// ----------------------------------------------------------------------------

// The vector table.
// This relies on the linker script to place at correct location in memory.

__attribute__ ((section(".isr_vector"),used))
pHandler __isr_vectors[] =
  { //
    (pHandler) &_estack,                          // The initial stack pointer
        Reset_Handler,                            // The reset handler

        NMI_Handler,                              // The NMI handler
        HardFault_Handler,                        // The hard fault handler

#if defined(__ARM_ARCH_7M__) || defined(__ARM_ARCH_7EM__)
        MemManage_Handler,                        // The MPU fault handler
        BusFault_Handler,// The bus fault handler
        UsageFault_Handler,// The usage fault handler
#else
        0, 0, 0,				  // Reserved
#endif
        0,                                        // Reserved
        0,                                        // Reserved
        0,                                        // Reserved
        0,                                        // Reserved
        SVC_Handler,                              // SVCall handler
#if defined(__ARM_ARCH_7M__) || defined(__ARM_ARCH_7EM__)
        DebugMon_Handler,                         // Debug monitor handler
#else
        0,					  // Reserved
#endif
        0,                                        // Reserved
        PendSV_Handler,                           // The PendSV handler
        SysTick_Handler,                          // The SysTick handler

        // ----------------------------------------------------------------------
        // gd32l23x vectors
        WWDGT_IRQHandler,                             // Window Watchdog Timer
        LVD_IRQHandler,                               // LVD through EXTI Line detect
        TAMPER_STAMP_IRQHandler,                      // RTC Tamper and TimeStamp through EXTI Line detect
        RTC_WKUP_IRQHandler,                          // RTC Wakeup from EXTI interrupt
        FMC_IRQHandler,                               // FMC global interrupt
        RCU_CTC_IRQHandler,                           // RCU or CTC global interrupt
        EXTI0_IRQHandler,                             // EXTI Line 0
        EXTI1_IRQHandler,                             // EXTI Line 1
        EXTI2_IRQHandler,                             // EXTI Line 2
        EXTI3_IRQHandler,                             // EXTI Line 3
        EXTI4_IRQHandler,                             // EXTI Line 4
        DMA_Channel0_IRQHandler,                      // DMA Channel 0
        DMA_Channel1_IRQHandler,                      // DMA Channel 1
        DMA_Channel2_IRQHandler,                      // DMA Channel 2
        DMA_Channel3_IRQHandler,                      // DMA Channel 3
        DMA_Channel4_IRQHandler,                      // DMA Channel 4
        DMA_Channel5_IRQHandler,                      // DMA Channel 5
        DMA_Channel6_IRQHandler,                      // DMA Channel 6
        ADC_IRQHandler,                               // ADC interrupt
        USBD_HP_IRQHandler,                           // USBD High Priority interrupt
        USBD_LP_IRQHandler,                           // USBD Low Priority interrupt
        TIMER1_IRQHandler,                            // TIMER1
        TIMER2_IRQHandler,                            // TIMER2
        TIMER8_IRQHandler,                            // TIMER8
        TIMER11_IRQHandler,                           // TIMER11
        TIMER5_IRQHandler,                            // TIMER5
        TIMER6_IRQHandler,                            // TIMER6
        USART0_IRQHandler,                            // USART0
        USART1_IRQHandler,                            // USART1
        UART3_IRQHandler,                             // UART3
        UART4_IRQHandler,                             // UART4
        I2C0_EV_IRQHandler,                           // I2C0 Event
        I2C0_ER_IRQHandler,                           // I2C0 Error
        I2C1_EV_IRQHandler,                           // I2C1 Event
        I2C1_ER_IRQHandler,                           // I2C1 Error
        SPI0_IRQHandler,                              // SPI0
        SPI1_IRQHandler,                              // SPI1
        DAC_IRQHandler,                               // DAC
        0,                                            // Reserved
        I2C2_EV_IRQHandler,                           // I2C2 Event
        I2C2_ER_IRQHandler,                           // I2C2 Error
        RTC_Alarm_IRQHandler,                         // RTC Alarm through EXTI Line detect
        USBD_WKUP_IRQHandler,                         // USBD wakeup through EXTI Line detect
        EXTI5_9_IRQHandler,                           // EXTI5 to EXTI9
        0,                                            // Reserved
        0,                                            // Reserved
        0,                                            // Reserved
        EXTI10_15_IRQHandler,                         // EXTI10 to EXT15
        0,                                            // Reserved
        0,                                            // Reserved
        0,                                            // Reserved
        0,                                            // Reserved
        0,                                            // Reserved
        0,                                            // Reserved
        0,                                            // Reserved
        DMAMUX_IRQHandler,                            // Reserved
        CMP0_IRQHandler,                              // Comparator 0 interrupt through EXTI Line detect
        CMP1_IRQHandler,                              // Comparator 1 interrupt through EXTI Line detect
        I2C0_WKUP_IRQHandler,                         // I2C0 Wakeup interrupt through EXTI Line detect
        I2C2_WKUP_IRQHandler,                         // I2C2 Wakeup interrupt through EXTI Line detect
        USART0_WKUP_IRQHandler,                       // USART0 Wakeup interrupt through EXTI Line detect
        LPUART_IRQHandler,                            // LPUART global interrupt
        CAU_IRQHandler,                               // CAU
        TRNG_IRQHandler,                              // TRNG
        SLCD_IRQHandler,                              // SLCD
        USART1_WKUP_IRQHandler,                       // USART1 Wakeup interrupt through EXTI Line detect
        I2C1_WKUP_IRQHandler,                         // I2C1 Wakeup interrupt through EXTI Line detect
        LPUART_WKUP_IRQHandler,                       // LPUART Wakeup interrupt through EXTI Line detect
        LPTIMER_IRQHandler,                           // LPTIMER interrupt
    };

// ----------------------------------------------------------------------------

// Processor ends up here if an unexpected interrupt occurs or a specific
// handler is not present in the application code.

void __attribute__ ((section(".after_vectors")))
Default_Handler(void)
{
  while (1)
    {
	  ;
    }
}

// ----------------------------------------------------------------------------
